{
  "weekNumber": 6,
  "startDate": "2025-03-10",
  "stats": {},
  "runs": [
    {
      "date": "2025-03-10",
      "type": "Rest Day",
      "distance": 0,
      "planned": "Rest Day. Focus on recovery after yesterday's quality session. Optional light stretching or yoga.",
      "actualDistance": null,
      "actual": null
    },
    {
      "date": "2025-03-11",
      "type": "Easy Run",
      "distance": 7,
      "planned": "Easy Run 7km at 6:30-7:00/km pace. This is a step-back week, so focus on relaxed, comfortable running. Monitor how your body is responding to the increased training load of recent weeks.",
      "actualDistance": null,
      "actual": "A bit faster than planned as I was feeling good. Going to be a hot one today! Still mostly cool out, but could feel the temps increasing near the end. Good stuff!"
    },
    {
      "date": "2025-03-12",
      "type": "Long Run",
      "distance": 18,
      "planned": "Long Run 18km at 6:15-6:45/km pace. Keep effort comfortable with no structured pace work this week. This reduced long run allows recovery while maintaining endurance. Focus on good form throughout. Take water as needed - continue practicing your hydration strategy even on easier weeks.",
      "actualDistance": 18.8,
      "actual": "Was always going to be a hot one. Took frequent stops for water, since this one wasn’t meant to be about suffering and it’s a step-back week. Ok in the end."
    },
    {
      "date": "2025-03-13",
      "type": "Rest Day",
      "distance": 0,
      "planned": "Rest Day. Focus on recovery, hydration and good nutrition. Optional light mobility work to keep muscles loose.",
      "actualDistance": null,
      "actual": null
    },
    {
      "date": "2025-03-14",
      "type": "Easy Run",
      "distance": 7,
      "planned": "Easy Run 7km at 6:30-7:00/km pace. Keep effort very relaxed. Consider tracking morning heart rate this week to establish your normal baseline - this can help identify early signs of overtraining in more intense training weeks ahead.",
      "actualDistance": null,
      "actual": "Pretty good, but starting to get warm by the time I got out."
    },
    {
      "date": "2025-03-15",
      "type": "Quality",
      "distance": 9,
      "planned": "Marathon Pace Session: Total 9km as follows: 2km warmup, 5km at marathon pace (6:10-6:20/km), 2km cooldown. The focus is on maintaining perfect marathon pace - you should finish feeling like you could have run much further at this pace. This is a confidence-building session to practice race pace before moving to the Peak Phase of training.",
      "actualDistance": 9.2,
      "actual": "Like hot yoga, but running! Thankfully pretty overcast. Just took it easy and was ok."
    },
    {
      "date": "2025-03-16",
      "type": "Medium Long Run",
      "distance": 12,
      "planned": "Medium-Long Run 12km at 6:30-6:45/km pace. Moderate hills, focus on form rather than speed. This is a reduction in distance from previous weeks to allow recovery before entering the Peak Phase. Pay attention to how your body feels on hills after several weeks of hill-focused training.",
      "actualDistance": 12.4,
      "actual": "Mt Eliza to Frankston and back. Wet, cold, and windy … finally? Actually felt quite strong."
    }
  ]
}
